InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/FLASH/Peripheral/Register/xHeader/FLASH_RegisterDefines.h
/**
 *
 * @file FLASH_RegisterDefines.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 21 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 21 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */

#ifndef XDRIVER_MCU_DRIVER_HEADER_FLASH_FLASH_PERIPHERAL_FLASH_REGISTER_FLASH_REGISTERDEFINES_H_
#define XDRIVER_MCU_DRIVER_HEADER_FLASH_FLASH_PERIPHERAL_FLASH_REGISTER_FLASH_REGISTERDEFINES_H_

#include <xDriver_MCU/FLASH/Peripheral/xHeader/FLASH_Enum.h>

/******************************************************************************************
************************************ 1 ADDRESS *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_ADDRESS_R_OFFSET_MASK    ((uint32_t) 0x000FFFFFUL)
#define FLASH_ADDRESS_R_OFFSET_BIT    (0UL)

#define FLASH_ADDRESS_OFFSET_MASK    ((uint32_t) 0x000FFFFFUL)
/*----------*/

/******************************************************************************************
************************************ 2 DATA *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_DATA_R_DATA_MASK    ((uint32_t) 0xFFFFFFFFUL)
#define FLASH_DATA_R_DATA_BIT    (0UL)

#define FLASH_DATA_DATA_MASK    ((uint32_t) 0xFFFFFFFFUL)
/*----------*/

/******************************************************************************************
************************************ 3 CTL *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_CTL_R_WRITE_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_CTL_R_WRITE_BIT    (0UL)
#define FLASH_CTL_R_WRITE_COMPLETE    ((uint32_t) 0x00000000UL)
#define FLASH_CTL_R_WRITE_NOCOMPLETE    ((uint32_t) 0x00000001UL)
#define FLASH_CTL_R_WRITE_WRITE    ((uint32_t) 0x00000001UL)

#define FLASH_CTL_WRITE_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_CTL_WRITE_COMPLETE    ((uint32_t) 0x00000000UL)
#define FLASH_CTL_WRITE_NOCOMPLETE    ((uint32_t) 0x00000001UL)
#define FLASH_CTL_WRITE_WRITE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_CTL_R_ERASE_MASK    ((uint32_t) 0x00000002UL)
#define FLASH_CTL_R_ERASE_BIT    (1UL)
#define FLASH_CTL_R_ERASE_COMPLETE    ((uint32_t) 0x00000000UL)
#define FLASH_CTL_R_ERASE_NOCOMPLETE    ((uint32_t) 0x00000002UL)
#define FLASH_CTL_R_ERASE_ERASE    ((uint32_t) 0x00000002UL)

#define FLASH_CTL_ERASE_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_CTL_ERASE_COMPLETE    ((uint32_t) 0x00000000UL)
#define FLASH_CTL_ERASE_NOCOMPLETE    ((uint32_t) 0x00000001UL)
#define FLASH_CTL_ERASE_ERASE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_CTL_R_MERASE_MASK    ((uint32_t) 0x00000004UL)
#define FLASH_CTL_R_MERASE_BIT    (2UL)
#define FLASH_CTL_R_MERASE_COMPLETE    ((uint32_t) 0x00000000UL)
#define FLASH_CTL_R_MERASE_NOCOMPLETE    ((uint32_t) 0x00000004UL)
#define FLASH_CTL_R_MERASE_MERASE    ((uint32_t) 0x00000004UL)

#define FLASH_CTL_MERASE_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_CTL_MERASE_COMPLETE    ((uint32_t) 0x00000000UL)
#define FLASH_CTL_MERASE_NOCOMPLETE    ((uint32_t) 0x00000001UL)
#define FLASH_CTL_MERASE_MERASE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_CTL_R_COMT_MASK    ((uint32_t) 0x00000008UL)
#define FLASH_CTL_R_COMT_BIT    (3UL)
#define FLASH_CTL_R_COMT_COMPLETE    ((uint32_t) 0x00000000UL)
#define FLASH_CTL_R_COMT_NOCOMPLETE    ((uint32_t) 0x00000008UL)
#define FLASH_CTL_R_COMT_WRITE    ((uint32_t) 0x00000008UL)

#define FLASH_CTL_COMT_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_CTL_COMT_COMPLETE    ((uint32_t) 0x00000000UL)
#define FLASH_CTL_COMT_NOCOMPLETE    ((uint32_t) 0x00000001UL)
#define FLASH_CTL_COMT_WRITE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_CTL_R_WRKEY_MASK    ((uint32_t) 0xFFFF0000UL)
#define FLASH_CTL_R_WRKEY_BIT    (16UL)
#define FLASH_CTL_R_WRKEY_KEY1    ((uint32_t) 0xA4420000UL)
#define FLASH_CTL_R_WRKEY_KEY2    ((uint32_t) 0x71D50000UL)

#define FLASH_CTL_WRKEY_MASK    ((uint32_t) 0x0000FFFFUL)
#define FLASH_CTL_WRKEY_KEY1    ((uint32_t) 0x0000A442UL)
#define FLASH_CTL_WRKEY_KEY2    ((uint32_t) 0x000071D5UL)
/*----------*/

/******************************************************************************************
************************************ 4 RIS *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_RIS_R_ARIS_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_RIS_R_ARIS_BIT    (0UL)
#define FLASH_RIS_R_ARIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_R_ARIS_ACTIVE    ((uint32_t) 0x00000001UL)

#define FLASH_RIS_ARIS_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_RIS_ARIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_ARIS_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_RIS_R_PRIS_MASK    ((uint32_t) 0x00000002UL)
#define FLASH_RIS_R_PRIS_BIT    (1UL)
#define FLASH_RIS_R_PRIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_R_PRIS_ACTIVE    ((uint32_t) 0x00000002UL)

#define FLASH_RIS_PRIS_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_RIS_PRIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_PRIS_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_RIS_R_ERIS_MASK    ((uint32_t) 0x00000004UL)
#define FLASH_RIS_R_ERIS_BIT    (2UL)
#define FLASH_RIS_R_ERIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_R_ERIS_ACTIVE    ((uint32_t) 0x00000004UL)

