InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/FLASH/Peripheral/Register/xHeader/FLASH_RegisterDefines.h
#define FLASH_RIS_ERIS_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_RIS_ERIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_ERIS_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_RIS_R_VOLTRIS_MASK    ((uint32_t) 0x00000200UL)
#define FLASH_RIS_R_VOLTRIS_BIT    (9UL)
#define FLASH_RIS_R_VOLTRIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_R_VOLTRIS_ACTIVE    ((uint32_t) 0x00000200UL)

#define FLASH_RIS_VOLTRIS_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_RIS_VOLTRIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_VOLTRIS_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_RIS_R_INVDRIS_MASK    ((uint32_t) 0x00000400UL)
#define FLASH_RIS_R_INVDRIS_BIT    (10UL)
#define FLASH_RIS_R_INVDRIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_R_INVDRIS_ACTIVE    ((uint32_t) 0x00000400UL)

#define FLASH_RIS_INVDRIS_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_RIS_INVDRIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_INVDRIS_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_RIS_R_ERRIS_MASK    ((uint32_t) 0x00000800UL)
#define FLASH_RIS_R_ERRIS_BIT    (11UL)
#define FLASH_RIS_R_ERRIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_R_ERRIS_ACTIVE    ((uint32_t) 0x00000800UL)

#define FLASH_RIS_ERRIS_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_RIS_ERRIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_ERRIS_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_RIS_R_PROGRIS_MASK    ((uint32_t) 0x00002000UL)
#define FLASH_RIS_R_PROGRIS_BIT    (13UL)
#define FLASH_RIS_R_PROGRIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_R_PROGRIS_ACTIVE    ((uint32_t) 0x00002000UL)

#define FLASH_RIS_PROGRIS_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_RIS_PROGRIS_NOACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_RIS_PROGRIS_ACTIVE    ((uint32_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************ 5 FCIM *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_IM_R_AMASK_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_IM_R_AMASK_BIT    (0UL)
#define FLASH_IM_R_AMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_R_AMASK_ENA    ((uint32_t) 0x00000001UL)

#define FLASH_IM_AMASK_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_IM_AMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_AMASK_ENA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_IM_R_PMASK_MASK    ((uint32_t) 0x00000002UL)
#define FLASH_IM_R_PMASK_BIT    (1UL)
#define FLASH_IM_R_PMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_R_PMASK_ENA    ((uint32_t) 0x00000002UL)

#define FLASH_IM_PMASK_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_IM_PMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_PMASK_ENA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_IM_R_EMASK_MASK    ((uint32_t) 0x00000004UL)
#define FLASH_IM_R_EMASK_BIT    (2UL)
#define FLASH_IM_R_EMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_R_EMASK_ENA    ((uint32_t) 0x00000004UL)

#define FLASH_IM_EMASK_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_IM_EMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_EMASK_ENA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_IM_R_VOLTMASK_MASK    ((uint32_t) 0x00000200UL)
#define FLASH_IM_R_VOLTMASK_BIT    (9UL)
#define FLASH_IM_R_VOLTMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_R_VOLTMASK_ENA    ((uint32_t) 0x00000200UL)

#define FLASH_IM_VOLTMASK_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_IM_VOLTMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_VOLTMASK_ENA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_IM_R_INVDMASK_MASK    ((uint32_t) 0x00000400UL)
#define FLASH_IM_R_INVDMASK_BIT    (10UL)
#define FLASH_IM_R_INVDMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_R_INVDMASK_ENA    ((uint32_t) 0x00000400UL)

#define FLASH_IM_INVDMASK_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_IM_INVDMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_INVDMASK_ENA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_IM_R_ERMASK_MASK    ((uint32_t) 0x00000800UL)
#define FLASH_IM_R_ERMASK_BIT    (11UL)
#define FLASH_IM_R_ERMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_R_ERMASK_ENA    ((uint32_t) 0x00000800UL)

#define FLASH_IM_ERMASK_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_IM_ERMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_ERMASK_ENA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_IM_R_PROGMASK_MASK    ((uint32_t) 0x00002000UL)
#define FLASH_IM_R_PROGMASK_BIT    (13UL)
#define FLASH_IM_R_PROGMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_R_PROGMASK_ENA    ((uint32_t) 0x00002000UL)

#define FLASH_IM_PROGMASK_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_IM_PROGMASK_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_IM_PROGMASK_ENA    ((uint32_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************ 6 MISC *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_MISC_R_AMISC_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_R_AMISC_BIT    (0UL)
#define FLASH_MISC_R_AMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_R_AMISC_ACTIVE    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_R_AMISC_CLEAR    ((uint32_t) 0x00000001UL)

#define FLASH_MISC_AMISC_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_AMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_AMISC_ACTIVE    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_AMISC_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_MISC_R_PMISC_MASK    ((uint32_t) 0x00000002UL)
#define FLASH_MISC_R_PMISC_BIT    (1UL)
#define FLASH_MISC_R_PMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_R_PMISC_ACTIVE    ((uint32_t) 0x00000002UL)
#define FLASH_MISC_R_PMISC_CLEAR    ((uint32_t) 0x00000002UL)

#define FLASH_MISC_PMISC_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_PMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_PMISC_ACTIVE    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_PMISC_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_MISC_R_EMISC_MASK    ((uint32_t) 0x00000004UL)
#define FLASH_MISC_R_EMISC_BIT    (2UL)
#define FLASH_MISC_R_EMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_R_EMISC_ACTIVE    ((uint32_t) 0x00000004UL)
#define FLASH_MISC_R_EMISC_CLEAR    ((uint32_t) 0x00000004UL)

#define FLASH_MISC_EMISC_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_EMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_EMISC_ACTIVE    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_EMISC_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_MISC_R_VOLTMISC_MASK    ((uint32_t) 0x00000200UL)
#define FLASH_MISC_R_VOLTMISC_BIT    (9UL)
#define FLASH_MISC_R_VOLTMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_R_VOLTMISC_ACTIVE    ((uint32_t) 0x00000200UL)
#define FLASH_MISC_R_VOLTMISC_CLEAR    ((uint32_t) 0x00000200UL)

#define FLASH_MISC_VOLTMISC_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_VOLTMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_VOLTMISC_ACTIVE    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_VOLTMISC_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_MISC_R_INVDMISC_MASK    ((uint32_t) 0x00000400UL)
#define FLASH_MISC_R_INVDMISC_BIT    (10UL)
#define FLASH_MISC_R_INVDMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_R_INVDMISC_ACTIVE    ((uint32_t) 0x00000400UL)
#define FLASH_MISC_R_INVDMISC_CLEAR    ((uint32_t) 0x00000400UL)

#define FLASH_MISC_INVDMISC_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_INVDMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_INVDMISC_ACTIVE    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_INVDMISC_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_MISC_R_ERMISC_MASK    ((uint32_t) 0x00000800UL)
#define FLASH_MISC_R_ERMISC_BIT    (11UL)
#define FLASH_MISC_R_ERMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_R_ERMISC_ACTIVE    ((uint32_t) 0x00000800UL)
#define FLASH_MISC_R_ERMISC_CLEAR    ((uint32_t) 0x00000800UL)

