InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/FLASH/Peripheral/Register/xHeader/FLASH_RegisterDefines.h
#define FLASH_MISC_ERMISC_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_ERMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_ERMISC_ACTIVE    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_ERMISC_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_MISC_R_PROGMISC_MASK    ((uint32_t) 0x0002000UL)
#define FLASH_MISC_R_PROGMISC_BIT    (13UL)
#define FLASH_MISC_R_PROGMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_R_PROGMISC_ACTIVE    ((uint32_t) 0x00002000UL)
#define FLASH_MISC_R_PROGMISC_CLEAR    ((uint32_t) 0x00002000UL)

#define FLASH_MISC_PROGMISC_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_PROGMISC_INACTIVE    ((uint32_t) 0x00000000UL)
#define FLASH_MISC_PROGMISC_ACTIVE    ((uint32_t) 0x00000001UL)
#define FLASH_MISC_PROGMISC_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************ 7 CTL2 *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_CTL2_R_WRBUF_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_CTL2_R_WRBUF_BIT    (0UL)
#define FLASH_CTL2_R_WRBUF_COMPLETE    ((uint32_t) 0x00000000UL)
#define FLASH_CTL2_R_WRBUF_NOCOMPLETE    ((uint32_t) 0x00000001UL)
#define FLASH_CTL2_R_WRBUF_WRITE    ((uint32_t) 0x00000001UL)

#define FLASH_CTL2_WRBUF_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_CTL2_WRBUF_COMPLETE    ((uint32_t) 0x00000000UL)
#define FLASH_CTL2_WRBUF_NOCOMPLETE    ((uint32_t) 0x00000001UL)
#define FLASH_CTL2_WRBUF_WRITE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_CTL2_R_WRKEY_MASK    ((uint32_t) 0xFFFF0000UL)
#define FLASH_CTL2_R_WRKEY_BIT    (16UL)
#define FLASH_CTL2_R_WRKEY_KEY1    ((uint32_t) 0xA4420000UL)
#define FLASH_CTL2_R_WRKEY_KEY2    ((uint32_t) 0x71D50000UL)

#define FLASH_CTL2_WRKEY_MASK    ((uint32_t) 0x0000FFFFUL)
#define FLASH_CTL2_WRKEY_KEY1    ((uint32_t) 0x0000A442UL)
#define FLASH_CTL2_WRKEY_KEY2    ((uint32_t) 0x000071D5UL)
/*----------*/

/******************************************************************************************
************************************ 8 WBVAL *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_WBVAL_R_WB0_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_R_WB0_BIT    (0UL)
#define FLASH_WBVAL_R_WB0_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB0_NEWDATA    ((uint32_t) 0x00000001UL)

#define FLASH_WBVAL_WB0_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB0_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB0_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB1_MASK    ((uint32_t) 0x00000002UL)
#define FLASH_WBVAL_R_WB1_BIT    (1UL)
#define FLASH_WBVAL_R_WB1_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB1_NEWDATA    ((uint32_t) 0x00000002UL)

#define FLASH_WBVAL_WB1_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB1_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB1_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB2_MASK    ((uint32_t) 0x00000004UL)
#define FLASH_WBVAL_R_WB2_BIT    (2UL)
#define FLASH_WBVAL_R_WB2_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB2_NEWDATA    ((uint32_t) 0x00000004UL)

#define FLASH_WBVAL_WB2_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB2_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB2_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB3_MASK    ((uint32_t) 0x00000008UL)
#define FLASH_WBVAL_R_WB3_BIT    (3UL)
#define FLASH_WBVAL_R_WB3_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB3_NEWDATA    ((uint32_t) 0x00000008UL)

#define FLASH_WBVAL_WB3_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB3_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB3_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB4_MASK    ((uint32_t) 0x00000010UL)
#define FLASH_WBVAL_R_WB4_BIT    (4UL)
#define FLASH_WBVAL_R_WB4_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB4_NEWDATA    ((uint32_t) 0x00000010UL)

#define FLASH_WBVAL_WB4_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB4_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB4_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB5_MASK    ((uint32_t) 0x00000020UL)
#define FLASH_WBVAL_R_WB5_BIT    (5UL)
#define FLASH_WBVAL_R_WB5_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB5_NEWDATA    ((uint32_t) 0x00000020UL)

#define FLASH_WBVAL_WB5_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB5_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB5_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB6_MASK    ((uint32_t) 0x00000040UL)
#define FLASH_WBVAL_R_WB6_BIT    (6UL)
#define FLASH_WBVAL_R_WB6_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB6_NEWDATA    ((uint32_t) 0x00000040UL)

#define FLASH_WBVAL_WB6_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB6_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB6_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB7_MASK    ((uint32_t) 0x00000080UL)
#define FLASH_WBVAL_R_WB7_BIT    (7UL)
#define FLASH_WBVAL_R_WB7_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB7_NEWDATA    ((uint32_t) 0x00000080UL)

#define FLASH_WBVAL_WB7_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB7_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB7_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB8_MASK    ((uint32_t) 0x00000100UL)
#define FLASH_WBVAL_R_WB8_BIT    (8UL)
#define FLASH_WBVAL_R_WB8_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB8_NEWDATA    ((uint32_t) 0x00000100UL)

#define FLASH_WBVAL_WB8_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB8_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB8_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB9_MASK    ((uint32_t) 0x00000200UL)
#define FLASH_WBVAL_R_WB9_BIT    (9UL)
#define FLASH_WBVAL_R_WB9_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB9_NEWDATA    ((uint32_t) 0x00000200UL)

#define FLASH_WBVAL_WB9_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB9_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB9_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB10_MASK    ((uint32_t) 0x00000400UL)
#define FLASH_WBVAL_R_WB10_BIT    (10UL)
#define FLASH_WBVAL_R_WB10_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB10_NEWDATA    ((uint32_t) 0x00000400UL)

#define FLASH_WBVAL_WB10_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB10_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB10_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB11_MASK    ((uint32_t) 0x00000800UL)
#define FLASH_WBVAL_R_WB11_BIT    (11UL)
#define FLASH_WBVAL_R_WB11_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB11_NEWDATA    ((uint32_t) 0x00000800UL)

#define FLASH_WBVAL_WB11_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB11_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB11_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB12_MASK    ((uint32_t) 0x00001000UL)
#define FLASH_WBVAL_R_WB12_BIT    (12UL)
#define FLASH_WBVAL_R_WB12_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB12_NEWDATA    ((uint32_t) 0x00001000UL)

