InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/FLASH/Peripheral/Register/xHeader/FLASH_RegisterDefines.h
#define FLASH_WBVAL_WB12_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB12_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB12_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB13_MASK    ((uint32_t) 0x00002000UL)
#define FLASH_WBVAL_R_WB13_BIT    (13UL)
#define FLASH_WBVAL_R_WB13_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB13_NEWDATA    ((uint32_t) 0x00002000UL)

#define FLASH_WBVAL_WB13_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB13_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB13_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB14_MASK    ((uint32_t) 0x00004000UL)
#define FLASH_WBVAL_R_WB14_BIT    (14UL)
#define FLASH_WBVAL_R_WB14_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB14_NEWDATA    ((uint32_t) 0x00004000UL)

#define FLASH_WBVAL_WB14_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB14_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB14_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB15_MASK    ((uint32_t) 0x00008000UL)
#define FLASH_WBVAL_R_WB15_BIT    (15UL)
#define FLASH_WBVAL_R_WB15_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB15_NEWDATA    ((uint32_t) 0x00008000UL)

#define FLASH_WBVAL_WB15_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB15_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB15_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB16_MASK    ((uint32_t) 0x00010000UL)
#define FLASH_WBVAL_R_WB16_BIT    (16UL)
#define FLASH_WBVAL_R_WB16_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB16_NEWDATA    ((uint32_t) 0x00010000UL)

#define FLASH_WBVAL_WB16_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB16_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB16_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB17_MASK    ((uint32_t) 0x00020000UL)
#define FLASH_WBVAL_R_WB17_BIT    (17UL)
#define FLASH_WBVAL_R_WB17_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB17_NEWDATA    ((uint32_t) 0x00020000UL)

#define FLASH_WBVAL_WB17_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB17_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB17_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB18_MASK    ((uint32_t) 0x00040000UL)
#define FLASH_WBVAL_R_WB18_BIT    (18UL)
#define FLASH_WBVAL_R_WB18_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB18_NEWDATA    ((uint32_t) 0x00040000UL)

#define FLASH_WBVAL_WB18_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB18_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB18_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB19_MASK    ((uint32_t) 0x00080000UL)
#define FLASH_WBVAL_R_WB19_BIT    (19UL)
#define FLASH_WBVAL_R_WB19_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB19_NEWDATA    ((uint32_t) 0x00080000UL)

#define FLASH_WBVAL_WB19_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB19_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB19_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB20_MASK    ((uint32_t) 0x00100000UL)
#define FLASH_WBVAL_R_WB20_BIT    (20UL)
#define FLASH_WBVAL_R_WB20_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB20_NEWDATA    ((uint32_t) 0x00100000UL)

#define FLASH_WBVAL_WB20_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB20_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB20_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB21_MASK    ((uint32_t) 0x00200000UL)
#define FLASH_WBVAL_R_WB21_BIT    (21UL)
#define FLASH_WBVAL_R_WB21_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB21_NEWDATA    ((uint32_t) 0x00200000UL)

#define FLASH_WBVAL_WB21_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB21_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB21_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB22_MASK    ((uint32_t) 0x00400000UL)
#define FLASH_WBVAL_R_WB22_BIT    (22UL)
#define FLASH_WBVAL_R_WB22_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB22_NEWDATA    ((uint32_t) 0x00400000UL)

#define FLASH_WBVAL_WB22_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB22_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB22_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB23_MASK    ((uint32_t) 0x00800000UL)
#define FLASH_WBVAL_R_WB23_BIT    (23UL)
#define FLASH_WBVAL_R_WB23_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB23_NEWDATA    ((uint32_t) 0x00800000UL)

#define FLASH_WBVAL_WB23_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB23_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB23_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB24_MASK    ((uint32_t) 0x01000000UL)
#define FLASH_WBVAL_R_WB24_BIT    (24UL)
#define FLASH_WBVAL_R_WB24_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB24_NEWDATA    ((uint32_t) 0x01000000UL)

#define FLASH_WBVAL_WB24_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB24_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB24_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB25_MASK    ((uint32_t) 0x02000000UL)
#define FLASH_WBVAL_R_WB25_BIT    (25UL)
#define FLASH_WBVAL_R_WB25_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB25_NEWDATA    ((uint32_t) 0x02000000UL)

#define FLASH_WBVAL_WB25_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB25_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB25_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB26_MASK    ((uint32_t) 0x04000000UL)
#define FLASH_WBVAL_R_WB26_BIT    (26UL)
#define FLASH_WBVAL_R_WB26_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB26_NEWDATA    ((uint32_t) 0x04000000UL)

