InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/FLASH/Peripheral/Register/xHeader/FLASH_RegisterDefines.h
#define FLASH_WBVAL_WB26_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB26_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB26_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB27_MASK    ((uint32_t) 0x08000000UL)
#define FLASH_WBVAL_R_WB27_BIT    (27UL)
#define FLASH_WBVAL_R_WB27_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB27_NEWDATA    ((uint32_t) 0x08000000UL)

#define FLASH_WBVAL_WB27_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB27_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB27_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB28_MASK    ((uint32_t) 0x10000000UL)
#define FLASH_WBVAL_R_WB28_BIT    (28UL)
#define FLASH_WBVAL_R_WB28_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB28_NEWDATA    ((uint32_t) 0x10000000UL)

#define FLASH_WBVAL_WB28_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB28_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB28_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB29_MASK    ((uint32_t) 0x20000000UL)
#define FLASH_WBVAL_R_WB29_BIT    (29UL)
#define FLASH_WBVAL_R_WB29_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB29_NEWDATA    ((uint32_t) 0x20000000UL)

#define FLASH_WBVAL_WB29_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB29_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB29_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB30_MASK    ((uint32_t) 0x40000000UL)
#define FLASH_WBVAL_R_WB30_BIT    (30UL)
#define FLASH_WBVAL_R_WB30_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB30_NEWDATA    ((uint32_t) 0x40000000UL)

#define FLASH_WBVAL_WB30_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB30_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB30_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_WBVAL_R_WB31_MASK    ((uint32_t) 0x80000000UL)
#define FLASH_WBVAL_R_WB31_BIT    (31UL)
#define FLASH_WBVAL_R_WB31_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_R_WB31_NEWDATA    ((uint32_t) 0x80000000UL)

#define FLASH_WBVAL_WB31_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_WBVAL_WB31_NODATA    ((uint32_t) 0x00000000UL)
#define FLASH_WBVAL_WB31_NEWDATA    ((uint32_t) 0x00000001UL)
/*----------*/


/******************************************************************************************
************************************ 9 PEKEY *********************************************
******************************************************************************************/
/*----------*/
#define FLASH_PEKEY_R_PEKEY_MASK    ((uint32_t) 0x0000FFFFUL)
#define FLASH_PEKEY_R_PEKEY_BIT    (16UL)
#define FLASH_PEKEY_R_PEKEY_KEY1    ((uint32_t) 0x0000A442UL)
#define FLASH_PEKEY_R_PEKEY_KEY2    ((uint32_t) 0x000071D5UL)

#define FLASH_PEKEY_PEKEY_MASK    ((uint32_t) 0x0000FFFFUL)
#define FLASH_PEKEY_PEKEY_KEY1    ((uint32_t) 0x0000A442UL)
#define FLASH_PEKEY_PEKEY_KEY2    ((uint32_t) 0x000071D5UL)
/*----------*/

/******************************************************************************************
************************************ 9-40 WBn *********************************************
******************************************************************************************/



/******************************************************************************************
************************************ 41 PP *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_PP_R_SIZE_MASK    ((uint32_t) 0x0000FFFFUL)
#define FLASH_PP_R_SIZE_BIT    (0UL)
#define FLASH_PP_R_SIZE_256KB    ((uint32_t) 0x0000007FUL)
#define FLASH_PP_R_SIZE_1024KB    ((uint32_t) 0x000001FFUL)

#define FLASH_PP_SIZE_MASK    ((uint32_t) 0x0000FFFFUL)
#define FLASH_PP_SIZE_256KB    ((uint32_t) 0x0000007FUL)
#define FLASH_PP_SIZE_1024KB    ((uint32_t) 0x000001FFUL)
/*----------*/

/*----------*/
#define FLASH_PP_R_MAINSS_MASK    ((uint32_t) 0x00070000UL)
#define FLASH_PP_R_MAINSS_BIT    (16UL)
#define FLASH_PP_R_MAINSS_1KB    ((uint32_t) 0x00000000UL)
#define FLASH_PP_R_MAINSS_2KB    ((uint32_t) 0x00010000UL)
#define FLASH_PP_R_MAINSS_4KB    ((uint32_t) 0x00020000UL)
#define FLASH_PP_R_MAINSS_8KB    ((uint32_t) 0x00030000UL)
#define FLASH_PP_R_MAINSS_16KB    ((uint32_t) 0x00040000UL)

#define FLASH_PP_MAINSS_MASK    ((uint32_t) 0x00000007UL)
#define FLASH_PP_MAINSS_1KB    ((uint32_t) 0x00000000UL)
#define FLASH_PP_MAINSS_2KB    ((uint32_t) 0x00000001UL)
#define FLASH_PP_MAINSS_4KB    ((uint32_t) 0x00000002UL)
#define FLASH_PP_MAINSS_8KB    ((uint32_t) 0x00000003UL)
#define FLASH_PP_MAINSS_16KB    ((uint32_t) 0x00000004UL)
/*----------*/

/*----------*/
#define FLASH_PP_R_EESS_MASK    ((uint32_t) 0x00780000UL)
#define FLASH_PP_R_EESS_BIT    (19UL)
#define FLASH_PP_R_EESS_1KB    ((uint32_t) 0x00000000UL)
#define FLASH_PP_R_EESS_2KB    ((uint32_t) 0x00080000UL)
#define FLASH_PP_R_EESS_4KB    ((uint32_t) 0x00100000UL)
#define FLASH_PP_R_EESS_8KB    ((uint32_t) 0x00180000UL)

#define FLASH_PP_EESS_MASK    ((uint32_t) 0x0000000FUL)
#define FLASH_PP_EESS_1KB    ((uint32_t) 0x00000000UL)
#define FLASH_PP_EESS_2KB    ((uint32_t) 0x00000001UL)
#define FLASH_PP_EESS_4KB    ((uint32_t) 0x00000002UL)
#define FLASH_PP_EESS_8KB    ((uint32_t) 0x00000003UL)
/*----------*/

/*----------*/
#define FLASH_PP_R_DFA_MASK    ((uint32_t) 0x10000000UL)
#define FLASH_PP_R_DFA_BIT    (28UL)
#define FLASH_PP_R_DFA_NO    ((uint32_t) 0x00000000UL)
#define FLASH_PP_R_DFA_YES    ((uint32_t) 0x10000000UL)

#define FLASH_PP_DFA_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_PP_DFA_NO    ((uint32_t) 0x00000000UL)
#define FLASH_PP_DFA_YES    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_PP_R_FMM_MASK    ((uint32_t) 0x20000000UL)
#define FLASH_PP_R_FMM_BIT    (29UL)
#define FLASH_PP_R_FMM_NO    ((uint32_t) 0x00000000UL)
#define FLASH_PP_R_FMM_YES    ((uint32_t) 0x20000000UL)

#define FLASH_PP_FMM_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_PP_FMM_NO    ((uint32_t) 0x00000000UL)
#define FLASH_PP_FMM_YES    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_PP_R_PFC_MASK    ((uint32_t) 0x40000000UL)
#define FLASH_PP_R_PFC_BIT    (30UL)
#define FLASH_PP_R_PFC_SINGLE    ((uint32_t) 0x00000000UL)
#define FLASH_PP_R_PFC_TWO    ((uint32_t) 0x40000000UL)

#define FLASH_PP_PFC_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_PP_PFC_SINGLE    ((uint32_t) 0x00000000UL)
#define FLASH_PP_PFC_TWO    ((uint32_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************ 42 SRAM_SIZE *********************************************
******************************************************************************************/

/*----------*/
#define SRAM_SIZE_R_SIZE_MASK    ((uint32_t) 0x0000FFFFUL)
#define SRAM_SIZE_R_SIZE_BIT    (0UL)
#define SRAM_SIZE_R_SIZE_32KB    ((uint32_t) 0x0000007FUL)
#define SRAM_SIZE_R_SIZE_256KB    ((uint32_t) 0x000003FFUL)

#define SRAM_SIZE_SIZE_MASK    ((uint32_t) 0x0000FFFFUL)
#define SRAM_SIZE_SIZE_32KB    ((uint32_t) 0x0000007FUL)
#define SRAM_SIZE_SIZE_256KB    ((uint32_t) 0x000003FFUL)
/*----------*/

/******************************************************************************************
************************************ 43 CONF *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_CONF_R_FPFOFF_MASK    ((uint32_t) 0x00010000UL)
#define FLASH_CONF_R_FPFOFF_BIT    (16UL)
#define FLASH_CONF_R_FPFOFF_NA    ((uint32_t) 0x00000000UL)
#define FLASH_CONF_R_FPFOFF_FORCE    ((uint32_t) 0x00010000UL)

