InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/FLASH/Peripheral/Register/xHeader/FLASH_RegisterDefines.h
#define FLASH_CONF_FPFOFF_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_CONF_FPFOFF_NA    ((uint32_t) 0x00000000UL)
#define FLASH_CONF_FPFOFF_FORCE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_CONF_R_FPFON_MASK    ((uint32_t) 0x00020000UL)
#define FLASH_CONF_R_FPFON_BIT    (17UL)
#define FLASH_CONF_R_FPFON_NA    ((uint32_t) 0x00000000UL)
#define FLASH_CONF_R_FPFON_FORCE    ((uint32_t) 0x00020000UL)

#define FLASH_CONF_FPFON_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_CONF_FPFON_NA    ((uint32_t) 0x00000000UL)
#define FLASH_CONF_FPFON_FORCE    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_CONF_R_CLRTV_MASK    ((uint32_t) 0x00100000UL)
#define FLASH_CONF_R_CLRTV_BIT    (20UL)
#define FLASH_CONF_R_CLRTV_NA    ((uint32_t) 0x00000000UL)
#define FLASH_CONF_R_CLRTV_CLEAR    ((uint32_t) 0x00100000UL)

#define FLASH_CONF_CLRTV_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_CONF_CLRTV_NA    ((uint32_t) 0x00000000UL)
#define FLASH_CONF_CLRTV_CLEAR    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_CONF_R_SPFE_MASK    ((uint32_t) 0x20000000UL)
#define FLASH_CONF_R_SPFE_BIT    (29UL)
#define FLASH_CONF_R_SPFE_FOUR    ((uint32_t) 0x00000000UL)
#define FLASH_CONF_R_SPFE_TWO    ((uint32_t) 0x20000000UL)

#define FLASH_CONF_SPFE_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_CONF_SPFE_FOUR    ((uint32_t) 0x00000000UL)
#define FLASH_CONF_SPFE_TWO    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define FLASH_CONF_R_FMME_MASK    ((uint32_t) 0x40000000UL)
#define FLASH_CONF_R_FMME_BIT    (30UL)
#define FLASH_CONF_R_FMME_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_CONF_R_FMME_ENA    ((uint32_t) 0x40000000UL)

#define FLASH_CONF_FMME_MASK    ((uint32_t) 0x00000001UL)
#define FLASH_CONF_FMME_DIS    ((uint32_t) 0x00000000UL)
#define FLASH_CONF_FMME_ENA    ((uint32_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************ 44 ROM_SWMAP *********************************************
******************************************************************************************/

/*----------*/
#define ROM_SWMAP_R_SW0EN_MASK    ((uint32_t) 0x00000003UL)
#define ROM_SWMAP_R_SW0EN_BIT    (0UL)
#define ROM_SWMAP_R_SW0EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_R_SW0EN_PRESENT    ((uint32_t) 0x00000001UL)

#define ROM_SWMAP_SW0EN_MASK    ((uint32_t) 0x00000003UL)
#define ROM_SWMAP_SW0EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_SW0EN_PRESENT    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define ROM_SWMAP_R_SW1EN_MASK    ((uint32_t) 0x0000000CUL)
#define ROM_SWMAP_R_SW1EN_BIT    (2UL)
#define ROM_SWMAP_R_SW1EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_R_SW1EN_PRESENT    ((uint32_t) 0x00000004UL)

#define ROM_SWMAP_SW1EN_MASK    ((uint32_t) 0x00000003UL)
#define ROM_SWMAP_SW1EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_SW1EN_PRESENT    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define ROM_SWMAP_R_SW2EN_MASK    ((uint32_t) 0x00000030UL)
#define ROM_SWMAP_R_SW2EN_BIT    (4UL)
#define ROM_SWMAP_R_SW2EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_R_SW2EN_PRESENT    ((uint32_t) 0x00000010UL)

#define ROM_SWMAP_SW2EN_MASK    ((uint32_t) 0x00000003UL)
#define ROM_SWMAP_SW2EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_SW2EN_PRESENT    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define ROM_SWMAP_R_SW3EN_MASK    ((uint32_t) 0x000000C0UL)
#define ROM_SWMAP_R_SW3EN_BIT    (6UL)
#define ROM_SWMAP_R_SW3EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_R_SW3EN_PRESENT    ((uint32_t) 0x00000040UL)

#define ROM_SWMAP_SW3EN_MASK    ((uint32_t) 0x00000003UL)
#define ROM_SWMAP_SW3EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_SW3EN_PRESENT    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define ROM_SWMAP_R_SW4EN_MASK    ((uint32_t) 0x00000300UL)
#define ROM_SWMAP_R_SW4EN_BIT    (8UL)
#define ROM_SWMAP_R_SW4EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_R_SW4EN_PRESENT    ((uint32_t) 0x00000100UL)

#define ROM_SWMAP_SW4EN_MASK    ((uint32_t) 0x00000003UL)
#define ROM_SWMAP_SW4EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_SW4EN_PRESENT    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define ROM_SWMAP_R_SW5EN_MASK    ((uint32_t) 0x00000C00UL)
#define ROM_SWMAP_R_SW5EN_BIT    (10UL)
#define ROM_SWMAP_R_SW5EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_R_SW5EN_PRESENT    ((uint32_t) 0x00000400UL)

#define ROM_SWMAP_SW5EN_MASK    ((uint32_t) 0x00000003UL)
#define ROM_SWMAP_SW5EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_SW5EN_PRESENT    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define ROM_SWMAP_R_SW6EN_MASK    ((uint32_t) 0x00003000UL)
#define ROM_SWMAP_R_SW6EN_BIT    (12UL)
#define ROM_SWMAP_R_SW6EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_R_SW6EN_PRESENT    ((uint32_t) 0x00001000UL)

#define ROM_SWMAP_SW6EN_MASK    ((uint32_t) 0x00000003UL)
#define ROM_SWMAP_SW6EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_SW6EN_PRESENT    ((uint32_t) 0x00000001UL)
/*----------*/

/*----------*/
#define ROM_SWMAP_R_SW7EN_MASK    ((uint32_t) 0x0000C000UL)
#define ROM_SWMAP_R_SW7EN_BIT    (14UL)
#define ROM_SWMAP_R_SW7EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_R_SW7EN_PRESENT    ((uint32_t) 0x00004000UL)

#define ROM_SWMAP_SW7EN_MASK    ((uint32_t) 0x00000003UL)
#define ROM_SWMAP_SW7EN_NOPRESENT    ((uint32_t) 0x00000000UL)
#define ROM_SWMAP_SW7EN_PRESENT    ((uint32_t) 0x00000001UL)
/*----------*/

/******************************************************************************************
************************************ 45 DMASZ *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_DMASZ_R_SIZE_MASK    ((uint32_t) 0x0003FFFFUL)
#define FLASH_DMASZ_R_SIZE_BIT    (0UL)

#define FLASH_DMASZ_SIZE_MASK    ((uint32_t) 0x0003FFFFUL)
/*----------*/

/******************************************************************************************
************************************ 46 DMAST *********************************************
******************************************************************************************/

/*----------*/
#define FLASH_DMAST_R_ADDR_MASK    ((uint32_t) 0x1FFFF800UL)
#define FLASH_DMAST_R_ADDR_BIT    (11UL)

#define FLASH_DMAST_ADDR_MASK    ((uint32_t) 0x0003FFFFUL)
/*----------*/

#endif /* XDRIVER_MCU_DRIVER_HEADER_FLASH_FLASH_PERIPHERAL_FLASH_REGISTER_FLASH_REGISTERDEFINES_H_ */
